sslivins/arctic-controller/sdkconfig.defaults
# Arctic Heat Pump Controller - ESP32-P4 Tab5 Configuration

CONFIG_IDF_TARGET="esp32p4"
# ESP-IDF 6.x defaults to requiring P4 silicon rev >= v3.1; the Tab5 hardware is
# rev v1.3, so target the pre-v3 silicon family explicitly. Note Espressif treats
# rev <3.0 and >=3.0 as mutually exclusive - one binary cannot serve both.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Main task stack - needs headroom for LVGL deep layout/font measurement chains
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Home Assistant local-push transport and device feasibility tests
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_WS_PRE_HANDSHAKE_CB_SUPPORT=y

# ESP-IDF 6.1 no longer invokes the WebSocket URI handler for the handshake
# request itself, so client registration moved to ws_post_handshake_cb.
CONFIG_HTTPD_WS_POST_HANDSHAKE_CB_SUPPORT=y
CONFIG_LWIP_MAX_SOCKETS=24
# Shared LWIP active-TCP PCB pool. Raised 16->24 to match MAX_SOCKETS so the
# four HTTPS/HTTP servers plus outbound clients cannot exhaust the pool under
# the full test suite. At 16, TIME_WAIT churn from the HTTPS server's
# lru_purge (see api_server.cpp max_open_sockets) starved this pool and took
# every server (443/8443/web) unresponsive at once (mbedtls -0x7780 storm).
CONFIG_LWIP_MAX_ACTIVE_TCP=24

# TCP window / send buffer. IDF's stock 5760 is 4x MSS, which caps throughput
# at window/RTT regardless of link speed: measured against the CI controller at
# ~10 ms idle RTT (~23 ms effective under load) that is a hard ~250 KB/s
# ceiling, and a 2.7 MB PNG screenshot duly took ~11 s. The tell that it was
# the window and not the encoder, TLS or the flash was that PNG and JPEG
# measured the SAME throughput (253 vs 280 KB/s) despite a 28x size difference
# -- both were pinned to the same BDP ceiling, with the radio idle most of each
# round trip waiting for an ACK.
#
# 6x MSS is measured, not guessed. On the CI controller, mean PNG download:
#
#      5760 (4x MSS)   253 KB/s
#      8640 (6x MSS)   363 KB/s
#     11520 (8x MSS)   333 KB/s
#
# 8x is no better than 6x -- that difference is run-to-run variance -- which is
# the signature of a ceiling that is no longer the window. Past ~8 KB the limit
# is the P4 -> SDIO -> C6 -> radio path at ~350-400 KB/s, so a larger window
# would spend internal RAM for nothing. 6x also matches what the BDP math
# predicts from the other direction (350 KB/s x 23 ms ~= 8 KB).
#
# Right-sizing matters because the cost is charged against internal RAM, where
# healthy runs bottom out at 24-33 KB free (see the heap gate in
# device-tests.yml and issue #247), and NOT against the ~23 MB of PSRAM that
# makes any "free heap" figure look comfortable.
#
# This does nothing for OTA upload, and is not expected to: that direction
# measured 74.7 / 75.2 / 72.4 KB/s at 4x / 6x / 8x MSS. Uploads are bound by
# the device writing each chunk to flash as it arrives, not by the window, so
# no TCP tuning will speed up an OTA.
#
# CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP was considered as a companion -- the
# same trade the esp_hosted mempool patch (0001-mempool-prefer-spiram) makes
# for the SDIO RX buffer, and P4 GDMA does reach PSRAM through the cache path
# -- but in IDF 6.1 it is not a placement-only switch: it also activates
# ESP_WIFI_CACHE_TX_BUFFER_NUM on the wifi-remote path and flips the
# LWIP_TCP_OOSEQ_MAX_PBUFS default from 4 to 0 (uncontrolled OOSEQ). Landing
# both at once would make an internal-heap regression unattributable. Revisit
# separately, with the heap gate's "heap int=" figure as before/after evidence.
CONFIG_LWIP_TCP_WND_DEFAULT=8640
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8640

# Test instrumentation is enabled only by device-tests.yml.
CONFIG_TEST_ENDPOINTS=n

CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
# Enable XIP from PSRAM - allows PSRAM reads (display framebuffer) to continue
# during SPI flash writes (OTA updates), preventing display flicker
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# ESP-Hosted WiFi Configuration (ESP32-C6 co-processor via SDIO)
# Using esp_hosted 1.4.0 to match M5Stack Tab5's pre-flashed C6 firmware
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
# Tab5 SDIO GPIOs for ESP32-C6 (from M5Stack docs and their demo sdkconfig)
# CLK=12, CMD=13, D0=11, D1=10, D2=9, D3=8, RST=15
# Note: esp_hosted 1.4.0 uses different symbol names than 2.11.x
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
# Note: Tab5 ESP32-C6 comes pre-flashed with WiFi SDIO firmware v1.4.1

# WiFi performance - keep IRAM optimizations enabled (device is always-on, plugged in)
CONFIG_ESP_WIFI_IRAM_OPT=y
CONFIG_ESP_WIFI_RX_IRAM_OPT=y
CONFIG_LWIP_IRAM_OPTIMIZATION=y
# Sleep optimization not needed - device never sleeps
CONFIG_ESP_WIFI_SLP_IRAM_OPT=n

# Disable WiFi power save for consistent low-latency API responses
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n

# WPA Supplicant memory optimizations
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_ENABLE_SAE_PK=n
CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT=n
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n

# Reduce WiFi buffers to save memory
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# mbedTLS optimizations - need larger buffers for GitHub HTTPS/TLS
# Allocate mbedTLS buffers in PSRAM (32MB available) to avoid exhausting
# the ~200KB of internal RAM during TLS handshakes
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# Move FreeRTOS functions from IRAM to flash
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y

# Reduce HAL IRAM usage
CONFIG_HAL_DEFAULT_ASSERTION_LEVEL=0

# Disable mbedTLS hardware acceleration IRAM placement
CONFIG_MBEDTLS_HARDWARE_AES=n
CONFIG_MBEDTLS_HARDWARE_SHA=n

# Newlib nano formatting - reduces code size
CONFIG_NEWLIB_NANO_FORMAT=y

CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# System event callbacks remain lightweight; API startup has its own task.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# LVGL Configuration
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_USE_PERF_MONITOR=y
# Keep LVGL out of IRAM. Under ESP-IDF 5.5 this symbol did not resolve, so the
# setting was silently ignored. Under 6.1 it takes effect and moves ~56 KB of
# LVGL .text into the 431 KB DIRAM pool, which starves the internal heap: the
# 16 KB httpd task stack no longer fits in L2MEM and heap_caps silently falls
# back to LP-SRAM (0x5010_0000). LP-SRAM costs ~400 CPU cycles per access from
# the HP core, so every stack touch on the httpd task ran ~50x slow and screen
# renders went from ~50 ms to 1-3 s. Measured: volatile loop 1,026,754 us/1M
# with this on vs 19,862 us/1M with it off.
# CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM is not set

# Never let LP-SRAM (RTC fast memory) back a general heap allocation. It is
# valid memory but roughly 400 cycles per access from the HP core, so a task
# stack that lands there is a silent ~50x performance cliff rather than an
# out-of-memory error. Excluding it turns internal RAM exhaustion into a loud
# ESP_ERR_HTTPD_TASK failure at startup instead.
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=n
# LVGL uses a custom allocator (main/lv_mem_psram.c) that draws widget memory
# from PSRAM instead of the ~180 KB internal RAM. Needed because the persistent
# tab shell keeps all four tab trees resident, which overflowed the internal
# builtin pool when a second full screen (Settings) was loaded on top.
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CUSTOM_MALLOC=y
CONFIG_LV_MEM_SIZE_KILOBYTES=128

# Display Configuration
# Use 2 DPI frame buffers for hardware double-buffering
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2

# Fonts - Reduced set to save code space
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y

# Screenshot support (test endpoint captures display as PNG)
CONFIG_LV_USE_SNAPSHOT=y
# QR code widget (used by the Web Interface settings screen)
CONFIG_LV_USE_QRCODE=y
# CONFIG_LV_USE_LODEPNG is not set

CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Certificate bundle for HTTPS (required for OTA from GitHub)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# HTTPS server (TLS on port 443)
CONFIG_ESP_HTTPS_SERVER_ENABLE=y

# OTA Rollback Protection
# When enabled, after an OTA update the bootloader marks the new partition as
# ESP_OTA_IMG_PENDING_VERIFY.  The firmware must call esp_ota_mark_app_valid()
# before the next reboot; otherwise the bootloader rolls back to the previous
# working partition.  This prevents a bad OTA from bricking the device.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# --- OTA flash-erase watchdog mitigations (ESP32-P4 host + esp_hosted C6 SDIO) ---
# On ESP32-P4 (RISC-V) a SPI-flash erase clears MIE globally, masking ALL
# interrupts (even IRAM ISRs) for the whole erase duration. A 64KB block erase
# (hundreds of ms .. ~2s worst case) starves the esp_hosted SDIO-RX servicing
# and blows the stock 300ms interrupt watchdog -> rst:0x7 (HP_SYS_HP_WDT_RESET),
# bricking the device mid-OTA. Force per-4KB-sector erases (short blackouts),
# yield between erases, and give both watchdogs generous headroom so a legitimate
# flash-erase blackout during an OTA download does not trip a reset. Device is
# mains-powered/always-on, so the larger WDT windows are an acceptable tradeoff.
CONFIG_SPI_FLASH_BYPASS_BLOCK_ERASE=y
CONFIG_SPI_FLASH_YIELD_DURING_ERASE=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=8000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60
# Turn a hung watched task into a recoverable reset instead of a silent warning.
# The TWDT watches the idle tasks (and the main service loop, which subscribes
# and feeds it) with a generous 60s window, so this only trips on a genuine
# hang. esp_restart() from the panic handler then recovers the device
# unattended, and the boot_stats crash-streak / safe-mode logic bounds any loop.
CONFIG_ESP_TASK_WDT_PANIC=y

# ESP-IDF 6.x: X.509 certificate creation defaults to off. The controller
# generates its own self-signed HTTPS identity certificate at runtime.
CONFIG_MBEDTLS_X509_CREATE_C=y
CONFIG_MBEDTLS_X509_CRT_WRITE_C=y

# Do not offer Curve25519 for ECDHE.
#
# The ESP32-P4 ECC peripheral accelerates SECP192R1/SECP256R1 only;
# Curve25519 is a Montgomery curve and runs entirely in software (the
# fixed-point ECP optimisation does not apply to it either). Mbed TLS 4.0
# changed the default group preference to put X25519 first, so under
# ESP-IDF 6.1 every inbound TLS handshake silently moved onto the software
# path.
#
# Measured on hardware, one HTTPS handshake to /api/health:
#   X25519 (6.1 default) : ~4.5 s
#   SECP256R1 (hardware) : ~0.43 s
#
# That is not merely slow: device-tests provisions credentials with
# `curl --connect-timeout 3`, which for HTTPS covers the TLS handshake, so
# every request failed with curl exit 28 and the suite could not start.
#
# The PSA primitives themselves are fine (ECDSA sign 12 ms, ECDH 5 ms,
# keygen 0.6 ms), which is what ruled out crypto in general and pointed at
# the negotiated group specifically.
#
# Dropping the curve makes both the server and outbound client connections
# negotiate SECP256R1. TLS 1.3 peers that offer only an X25519 key share
# simply get a HelloRetryRequest for P-256; P-256 is universally supported.
CONFIG_MBEDTLS_ECP_DP_CURVE25519_ENABLED=n

# ESP32-P4 revisions below v3.0 have no ECDSA peripheral; the PSA hardware
# ECDSA driver defaults on and logs errors on every verify before falling
# back to software.
CONFIG_MBEDTLS_HARDWARE_ECDSA_VERIFY=n

# ESP-IDF 6.1 has a higher internal-SRAM baseline than 5.5.2, and the
# default 16 KB always-internal threshold forces almost every allocation into
# internal RAM. With the threshold at 16384 the mandatory HTTPS server cannot
# obtain its contiguous 16 KB task stack (measured: free=33235,
# largest_block=12800). Allocations larger than 512 bytes now go to PSRAM by
# default; smaller objects and anything requesting MALLOC_CAP_INTERNAL/DMA are
# unaffected. Still required after the LVGL-IRAM fix below.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512


